<!DOCTYPE html>
<html>
    <body>
        <h1>Data Visualization</h1>
            <p>Ein Data Science Projekt im Rahmen des Studiengangs Wirtschaftsinformatik WWI2021F an der DHBW Stuttgart.<br>Erarbeitet von Lukas Gro&szlig;erhode.</p>
            <p>Verwendete Rohdatens&auml;tze: <a href="https://www.kaggle.com/datasets/usdot/flight-delays">2015 Flight Delays and Cancellations (kaggle.com)</a>
        <br>Eigene Cleaning-Datens&auml;tze: <a href="https://www.kaggle.com/datasets/lukasgrosserhode/data-visualization">Data Visualization (kaggle.com)</a>
        </p>
            <p>Die folgenden Visualisierungen sind auf Basis der Datens&auml;tzen, welche oben verlinkt sind, entstanden. Der "flights.csv"-Datensatz enth&auml;lt alle aufgezeichneten
                Linienfl&uuml;ge innerhalb der USA im Jahr 2015. Der "airlines.csv"-Datensatz gibt Aufschluss dar&uuml;ber, welche Airlines hierbei involviert waren. Der "airports.csv"-
                Datensatz gibt Auskunft &uuml;ber die entsprechenden US-Flugh&auml;fen sowie deren Koordinaten.
            </p>
            <br>
        <h3>1. Visualisierung</h3>
            <p>Diese erste Visualisierung soll einen ersten Einblick in die vorliegenden Datens&auml;tze erm&ouml;glichen. Hier wird die Anzahl der Starts im Jahr 2015
                f&uuml;r die obersten 25 US-Flugh&auml;fen in Form eines Balkendiagrammes dargestellt.
            </p>
            <a href="01_StartsAirport.html">Zur Visualisierung</a>
            <p><br></p>
        <h3>2. Visualisierung</h3>
            <p>In dieser Visualisierung wird ein Blick auf die p&uuml;nktlichen und versp&auml;teten Fl&uuml;ge pro Airline geworfen. Daf&uuml;r wird ein Balkendiagramm
                erstellt, welchem die Gesamtzahl an Fl&uuml;gen pro Airline (blau), sowie davon die p&uuml;nktlichen (gr&uuml;n) und versp&auml;teten (rot) zu entnehmen sind.
            </p>
            <a href="02_AirlineDelayCount.html">Zur Visualisierung</a>
            <p><br></p>
        <h3>3. Visualisierung</h3>
            <p>Diese Visualisierung zeigt alle vorliegenden Flugh&auml;fen auf einer Karte. Je heller hierbei der jeweilige Flughafen markiert ist, desto mehr Abfl&uuml;ge verzeichnet dieser.
                Wenn Sie mit Ihrer Maus &uuml;ber einen Flughafen hovern, k&ouml;nnen Sie die genaue Anzahl an Abfl&uuml;gen f&uuml;r das Jahr 2015 sehen.
            </p>
            <a href="03_AirportMap.html">Zur Visualisierung</a>
            <p><br></p>
        <h3>4. Visualisierung</h3>
            <p>Hier kann die Verteilung des Flugverkehrs nach Jahreszeiten in Form eines Kuchendiagrammes eingesehen werden.
            </p>
            <a href="04_SeasonFlights.html">Zur Visualisierung</a>
            <p><br></p>
        <h3>5. Visualisierung</h3>
            <p>Dieser etwas aufw&auml;ndigeren Visualisierung sind s&auml;mtliche Flugrouten, welche von den 5 gr&ouml;&szlig;ten US-Flugh&auml;fen (Atlanta, Chicago, Dallas, Denver, Los Angeles) ausgehen, zu entnehmen. 
                Wenn Sie mit Ihrer Maus &uuml;ber die schwarz umrahmten Punkte hovern, k&ouml;nnen Sie den Namen des jeweiligen Flughafens sehen. Je dicker die
                Linien der jeweiligen Flugroute sind, desto &ouml;fter wurden diese beflogen. Von wo aus diese beflogen wurden, k&ouml;nnen Sie an der Farbe der jeweiligen Route erkennen,
                denn diese stimmt mit der des Abflughafens &uuml;berein.
            </p>
            <a href="05_FlightMap.html">Zur Visualisierung</a>
            <p><br></p>
        <h3>6. Visualisierung</h3>
            <p>Diese Visualisierung veranschaulicht die Anzahl an Fl&uuml;gen in dem jeweiligen Monat. Hier kann man sehr gut erkennen, dass die meisten Fl&uuml;ge in den Sommermonaten
                stattfanden. Dass der Februar die wenigsten Fl&uuml;ge hat, ist wenig &uuml;berraschend, da dieser im Jahr 2015 nur 28 Tage hatte. 
                Interessant hingegen ist die Tatsache, dass im Juli mehr Fl&uuml;ge stattfanden als im August, obwohl der August einen Tag mehr hat. 
                Ansonsten ist aber gut zu erkennen, dass die Monate mit weniger Tagen auch tendenziell weniger Abfl&uuml;ge als die Monate mit mehr Tagen haben.
            </p>
            <a href="06_FlightsPerMonth.html">Zur Visualisierung</a>
            <p><br></p>
        <h3>7. Visualisierung</h3>
            <p>Diese letzte Visualisierung nimmt noch einmal Bezug auf versp&auml;tete Fl&uuml;ge im Verh&auml;ltnis zur Gesamtanzahl an Fl&uuml;gen. Hier wird ein Blick darauf geworfen, an
                welchen Wochentagen der P&uuml;nktlichkeitsanteil am h&ouml;chsten war. Den besten P&uuml;nktlichkeitswert erreichte der Samstag (97%), den schlechtesten der Donnerstag (95,7%)
                und der Freitag (95,8%).
            </p>
            <a href="07_WeekdayDelay.html">Zur Visualisierung</a>
            <p><br></p>
        <h3>Daten</h3>
            <iframe src="Bullying_2018_cleaned.csv" width="100%" height="400" style="border:1px solid #ccc;"></iframe>
        <p>&#169; 2022 Lukas Gro&szlig;erhode. Alle Rechte vorbehalten.</p>
    </body>
</html>
